"LANG" = "(English)";

"EXEC_ONYX" = "Opening OnyX";
"READ_PARAM" = "Reading parameters";
"READ_INFO" = "Reading information";
"CALC_CHECKSUM" = "Calculating checksums: ";

"TB_GENERAL" = "General";
"TB_BEHAVIOR" = "Behavior";
"TB_UPDATE" = "Update";
"TB_ACTIONS" = "Actions";
"TB_ADVANCED" = "Advanced";

"DEFAULT" = "by default";
"BY_PROC" = " (per processor)";
"BY_CORE" = " (per core)";
"USEDBYSYSTEM" = " (used by the system)";
"USEDBYONYX" = " (used by OnyX)";
"OCTETS" = " bytes";
"KO" = " KB";
"MO" = " MB";
"GO" = " GB";
"TO" = " TB";

"B_CANCEL" = "Cancel";
"B_CONTINUE" = "Continue";
"B_QUIT" = "Quit";
"B_DOWNLOAD" = "Download";
"B_RESTART" = "Restart";
"B_SHUTDOWN" = "Shut Down";
"B_CLOSE" = "Close";
"B_ENABLE" = "Turn On";
"B_DISABLE" = "Turn Off";
"B_CREATE" = "Create";
"B_DELETE" = "Delete";
"FIELD_ENABLED" = "Turned on";
"FIELD_DISABLED" = "Turned off";

/* CHECK UPDATE */
"CHECK_UPDATE" = "Checking for an update";
"ALRT_UPTODATE" = "OnyX is up-to-date.";
"MSG_UPTODATE" = "No new version is available.";
"NEW_VERS" = "A new version was detected.";
"MSG_VERSA" = "Your current OnyX version is ";
"MSG_VERSB" = ".\nThe latest available version is ";
"MSG_VERSC" = ".\n Do you want to download it?\n";
"DOWNLOAD_UPDATE" = "Downloading...";
"DOWNLOADED" = "The file has been downloaded.";
"MSG_DOWNLOADED" = "The latest version of OnyX has been downloaded to the desktop or into the folder you indicated in OnyX preferences.";
"ALRT_UPDATEBETA" = "It is not currently possible to search for a new version.";
"MSG_UPDATEBETA" = "Your current version is an OnyX beta version.\nIt is impossible for you to search for an update from a beta version.";

/* CHECK DISK */
"CHECK_DISK" = "Verifying the structure of the disk";
"MSG_CHECKDISK" = "Before running Maintenance or Cleaning tasks, you should allow OnyX to verify the startup disk.\nDuring the verification, you may see the wait cursor (which looks like a colored pinwheel), the Finder might slow down, and your computer might seem to be unresponsive. This is normal. Wait for the verification to finish.";
"CHECKDISK_OK" = "The disk has been verified.";
"MSG_CHECKDISK_OK" = "The startup disk appears to be OK.";
"CHECKDISK_NOTOK" = "The disk needs to be repaired.";
"MSG_CHECKDISK_NOTOK" = "To repair your startup disk, restart your computer while holding down Command-R, then select Disk Utility.";
"ERR_CHECKDISK" = "Checking is not possible.";
"MSG_NOJOURNALED" = "It is not possible to verify the startup disk because it is not journaled.";

/* MAINTENANCE */
"REPAIRPERM" = "Repairing permissions for the disk";
"LAST_EXEC" = "- Last run: ";
"DAILY" = "Executing the Daily scripts";
"WEEKLY" = "Executing the Weekly scripts";
"MONTHLY" = "Executing the Monthly scripts";
"CLEAN_DAILYSCRIPTSLOGS" = "Cleaning the Daily scripts log";
"CLEAN_WEEKLYSCRIPTSLOGS" = "Cleaning the Weekly scripts log";
"CLEAN_MONTHLYSCRIPTSLOGS" = "Cleaning the Monthly scripts log";
"CLEAN_ALLSCRIPTSLOGS" = "Cleaning all the maintenance scripts logs";
"MAINTAIN" = "Maintenance in progress...";
"LAUNCHSERVICES" = "Rebuilding the LaunchServices database";
"DYLD_CACHE" = "Updating the dyld's shared cache";
"XPC_CACHE" = "Rebuilding the XPC cache";
"COREDUET" = "Rebuilding the CoreDuet database";
"DSSTORE" = "Deleting the hidden .DS_Store files";
"INDEX_SPOTLIGHT" = "Rebuilding the Spotlight index";
"REBUILD_INDEXMAIL" = "Rebuilding Mail's mailboxes index";
"DELETE_INDEXMAIL" = "Deleting Mail's mailboxes index";
"HELPVIEWER" = "Resetting Mac Help";
"DISKPOSITIONS" = "Resetting the disk positions on the desktop";
"ENDMAINTAIN" = "The maintenance is finished.";
"MSG_ENDMAINTAIN" = "The selected maintenance commands have been executed.";

/* CLEANING */
"CLEAN" = "Cleaning in progress...";
"BOOT_CACHE" = "Deleting the Boot cache";
"KERNEL_CACHE" = "Deleting the Kernel cache";
"INTLDATA_CACHE" = "Deleting the International Data cache";
"CUPS_FILES" = "Deleting all the CUPS jobs";
"COMPQT_CACHE" = "Deleting the QuickTime components cache";
"COMPAUDIO_CACHE" = "Deleting the Audio components cache";
"COMPOTHERS_CACHE" = "Deleting the miscellaneous System components cache";
"APPS_CACHE" = "Deleting the applications cache";
"PREFPANES_CACHE" = "Deleting the preference panes cache";
"AU_CACHE" = "Deleting the Audio Units cache";
"JAVA_CACHE" = "Deleting the Java and Java Applets cache";
"DESKTOP_CACHE" = "Deleting the Desktop cache";
"ICONDOCK_CACHE" = "Deleting the Dock icons cache";
"COLORSYNC_CACHE" = "Deleting the ColorSync Profiles cache";
"QUICKLOOK_CACHE" = "Deleting the QuickLook cache";
"TEMP_ITEMS" = "Deleting the temporary items";
"ICONSERVICES" = "Deleting the IconServices cache";
"DNS_CACHE" = "Deleting the DNS cache";
"BROWSER_CACHE" = "Deleting the browser cache";
"DOWNLOAD_CACHE" = "Deleting the Download cache";
"BROWSER_HISTORY" = "Deleting the browser history";
"RECENT_SEARCH" = "Deleting the recent searches";
"WEBPAGE_PREVIEWS" = "Deleting the webpage previews";
"BOOKMARKS_ICONS" = "Deleting the Bookmarks icons";
"INFOS_FORM" = "Deleting the forms info";
"COOKIES" = "Deleting all cookies";
"SYSTEMFONTS_CACHE" = "Deleting the System fonts cache";
"ADOBEFONTS_CACHE" = "Deleting the Adobe fonts cache";
"MSFONTS_CACHE" = "Deleting the Microsoft fonts cache";
"QUARKFONTS_CACHE" = "Deleting the Quark fonts cache";
"APPSFONTS_CACHE" = "Deleting the miscellaneous fonts cache";
"ALL_LOGS" = "Deleting the logs";
"BASH_LOG" = "Deleting the bash logs and sessions";
"ARCHIVED_LOGS" = "Deleting the system archived logs";
"CONVERS_LOGS" = "Deleting the Instant message logs";
"DIAGNOSTICUSER_LOGS" = "Deleting the User Diagnostic Reports";
"DIAGNOSTICSYSTEM_LOGS" = "Deleting the System Diagnostic Reports";
"DIAGNOSTICMOBILE_LOGS" = "Deleting the Mobile Devices Diagnostic Reports";
"VERSIONS_AUTOSAVE" = "Deleting the Versions History and Auto Save Cache Data";
"STATES_APPS" = "Deleting the saved application states";
"RECENT_ITEMS" = "Deleting the Recent Items";
"RECENT_CONVERSIONS" = "Deleting the Recent Conversions for Calculator";
"MAIL_DOWNLOADS" = "Deleting the files in the Mail Downloads folder";
"SAVED_SEARCHES" = "Deleting the items in the Saved Searches folder";
"OBSOLETE_ITEMS" = "Deleting temporary and obsolete files";
"OLDITUNESLIB" = "Deleting the Previous iTunes Libraries";
"MYCOMPUTERS_LIST" = "Deleting the 'My Computers' list of Screen Sharing";
"CONTENTGUIDE_QT" = "Deleting the QuickTime Content Guide";
"DERIVEDDATA" = "Deleting the Xcode DerivedData folder contents";
"ENDCLEAN" = "The cleaning is finished.";
"MSG_ENDCLEAN" = "The selected cleaning commands have been executed.";
"ERASEFILE" = "Destroy the file: ";
"ERASEFOLDER" = "Destroy the folder: ";
"EMPTY_TRASH" = "Deleting the Trash contents";
"DESTROY_TRASH" = "Destroying the Trash contents";

/* UTILITIES */
"UPDATE_WHATIS" = "Updating the whatis database";
"SHOW_MANPAGE" = "Showing the man page: ";
"LOCATE_YES" = "Creating the locate database";
"LOCATE_NO" = "Deleting the locate database";
"MSG_DELETELOCATE" = "Do you really want to delete the locate database?";
"UPDATE_LOCATE" = "Updating the locate database";
"SEARCH_LOCATE" = "Searching in the locate database";
"ENDUPDLOCATE" = "The locate database has been updated.";
"MSG_ENDUPDLOCATE" = "The locate database has been successfully rebuilt and updated.";
"SEARCH_RESULT" = "Search Result";
"NO_ITEMFOUND" = "No item containing";
"NO_FOUND" = "was found.";
"MORE_ITEMFOUND" = "items containing";
"MORE_FOUND" = "were found.";
"ACCT_YES" = "Turning on the process accounting";
"ACCT_NO" = "Turning off the process accounting";
"SHOWDISK" = "Showing the disk: ";
"HIDEDISK" = "Hiding the disk: ";
"SHOWFOLDER" = "Showing the folder: ";
"HIDEFOLDER" = "Hiding the folder: ";
"SHOWFILE" = "Showing the file: ";
"HIDEFILE" = "Hiding the file: ";
"SHOWAPPLICATION" = "Showing the application: ";
"HIDEAPPLICATION" = "Hiding the application: ";
"CLEANAPPLEDOUBLE" = "Deleting the AppleDouble files in: ";
"READ_RECEIPT" = "Opening a receipt";
"ALGORITHM" = "Algorithm: ";

/* AUTOMATION */
"AUTOMATE" = "Automation in progress...";
"ENDAUTOMATE" = "The Automation is finished.";
"MSG_ENDAUTOMATE" = "The selected automation commands have been executed.";

/* PARAMETERS > GENERAL */
"NSAUTOMATICWINDOWANIMATIONSENABLED_YES" = "Turning on graphic effects when opening a window";
"NSAUTOMATICWINDOWANIMATIONSENABLED_NO" = "Turning off graphic effects when opening a window";
"NSSCROLLVIEWRUBBERBANDING_YES" = "Showing the rubber—band scrolling of windows";
"NSSCROLLVIEWRUBBERBANDING_NO" = "Hiding the rubber—band scrolling of windows";
"DESKTOPPICTURESHOWDEBUGTEXT_YES" = "Showing the location path of the current desktop picture on the desktop";
"DESKTOPPICTURESHOWDEBUGTEXT_NO" = "Hiding the location path of the current desktop picture on the desktop";
"HIENABLETHEMESWITCHHOTKEY_YES" = "Turning on the hotkey combination to turn the dark menu bar and Dock on or off";
"HIENABLETHEMESWITCHHOTKEY_NO" = "Turning off the hotkey combination to turn the dark menu bar and Dock on or off";
"APPLEPRESSANDHOLDENABLED_YES" = "Turning on the accent menu from the keyboard";
"APPLEPRESSANDHOLDENABLED_NO" = "Turning off the accent menu from the keyboard";
"NSWINDOWRESIZETIME" = "Modifying the speed of display of sheets";
"NSINITIALTOOLTIPDELAY" = "Modifying the speed of display of help tags";
"START_ANIMDESKTOP" = "Starting the animated desktop background";
"STOP_ANIMDESKTOP" = "Stopping the animated desktop background";
"SCREENCAPTURETYPE" = "Modifying the default screenshot format";
"DISABLESHADOW_NO" = "Showing the shadow in the window captures";
"DISABLESHADOW_YES" = "Hiding the shadow in the window captures";
"INCLUDEDATE_YES" = "Showing the date and the time in the name of captures";
"INCLUDEDATE_NO" = "Hiding the date and the time in the name of captures";
"SCREENCAPTURELOCATION" = "Modifying the saving path for screenshots";
"SCREENCAPTURENAME" = "Modifying the name of screenshots";
"NSRECENTDOCUMENTSLIMIT_YES" = "Showing Recent Items in the applications";
"NSRECENTDOCUMENTSLIMIT_NO" = "Hiding Recent Items in the applications";
"NSRECENTDOCUMENTSLIMIT" = "Modifying the number of Recent Items in the applications";
"NSNAVRECENTPLACESLIMIT" = "Modifying the number of Recent Places in the dialogs";
"REINIT_GENERAL" = "Reinitializing the general parameters";
"PARAMS_GENERAL" = "General parameters";

/* PARAMETERS > FINDER */
"ANIMATEWINDOWZOOM_YES" = "Turning on window zooming";
"ANIMATEWINDOWZOOM_NO" = "Turning off window zooming";
"ANIMATEINFOPANES_YES" = "Turning on animation in the Info window";
"ANIMATEINFOPANES_NO" = "Turning off animation in the Info window";
"APPLESHOWALLFILES_YES" = "Showing hidden files and folders";
"APPLESHOWALLFILES_NO" = "Hiding hidden files and folders";
"FXSHOWPOSIXPATHINTITLE_YES" = "Showing the path in the title of windows";
"FXSHOWPOSIXPATHINTITLE_NO" = "Hiding the path in the title of windows";
"CREATEDESKTOP_YES" = "Showing the desktop icons";
"CREATEDESKTOP_NO" = "Hiding the desktop icons";
"PATHBAR_ROOT" = "Showing from the root in the Path Bar";
"PATHBAR_HOME" = "Showing from the home folder in the Path Bar";
"KIOSK_YES" = "Turning off the Restart, Shut Down, and Log Out menu items in the Apple menu";
"KIOSK_NO" = "Turning on the Restart, Shut Down, and Log Out menu items in the Apple menu";
"INTERFACELEVEL_YES" = "Turning on the Simple Finder";
"INTERFACELEVEL_NO" = "Turning off the Simple Finder";
"PROHIBITFINDERPREFERENCES_YES" = "Hiding the Preferences menu item in the Finder menu";
"PROHIBITFINDERPREFERENCES_NO" = "Showing the Preferences menu item in the Finder menu";
"PROHIBITEMPTYTRASH_YES" = "Hiding the Empty Trash menu item in the Finder menu";
"PROHIBITEMPTYTRASH_NO" = "Showing the Empty Trash menu item in the Finder menu";
"QUITMENUITEM_YES" = "Showing the Quit Finder menu item in the Finder menu";
"QUITMENUITEM_NO" = "Hiding the Quit Finder menu item in the Finder menu";
"PROHIBITEJECT_YES" = "Hiding the Eject menu item in the File menu";
"PROHIBITEJECT_NO" = "Showing the Eject menu item in the File menu";
"PROHIBITBURN_YES" = "Hiding the Burn Disc menu item in the File menu";
"PROHIBITBURN_NO" = "Showing the Burn Disc menu item in the File menu";
"TOOLBARIMMUTABLE_YES" = "Hiding the Customize Toolbar menu item in the View menu";
"TOOLBARIMMUTABLE_NO" = "Showing the Customize Toolbar menu item in the View menu";
"VIEWOPTIONSIMMUTABLE_YES" = "Hiding the View Options menu item in the View menu";
"VIEWOPTIONSIMMUTABLE_NO" = "Showing the View Options menu item in the View menu";
"PROHIBITGOTOFOLDER_YES" = "Hiding the Go to Folder menu item in the Go menu";
"PROHIBITGOTOFOLDER_NO" = "Showing the Go to Folder menu item in the Go menu";
"PROHIBITCONNECTTO_YES" = "Hiding the Connect to Server menu item in the Go menu";
"PROHIBITCONNECTTO_NO" = "Showing the Connect to Server menu item in the Go menu";
"REINIT_FINDER" = "Reinitializing the Finder's hidden parameters";
"PARAMS_FINDER" = "Finder's hidden parameters";

/* PARAMETERS > DOCK */
"MINEFFECT_GENIE" = "Turning on the Genie effect";
"MINEFFECT_SCALE" = "Turning on the Scale effect";
"MINEFFECT_SUCK" = "Turning on the Suck effect";
"MINIMIZE128_YES" = "Turning off reduction proportional to windows in the Dock";
"MINIMIZE128_NO" = "Turning on reduction proportional to windows in the Dock";
"ORIENTATION_BOTTOM" = "Showing the Dock at the bottom of the screen";
"ORIENTATION_LEFT" = "Showing the Dock on the left side of the screen";
"ORIENTATION_RIGHT" = "Showing the Dock on the right side of the screen";
"LAUNCHANIM_YES" = "Turning on animation when applications open";
"LAUNCHANIM_NO" = "Turning off animation when applications open";
"NOBOUNCING_YES" = "Turning off animation when an alert message appears in the background";
"NOBOUNCING_NO" = "Turning on animation when an alert message appears in the background";
"STATICONLY_YES" = "Showing only running applications in the Dock";
"STATICONLY_NO" = "Showing all applications in the Dock";
"SHOWHIDDEN_YES" = "Turning on transparency for hidden applications in the Dock";
"SHOWHIDDEN_NO" = "Turning off transparency for hidden applications in the Dock";
"AUTOHIDE_YES" = "Turning on automatically hiding and showing the Dock";
"AUTOHIDE_NO" = "Turning off automatically hiding and showing the Dock";
"AUTOHIDETIMEMODIFIER_YES" = "Turning on animation when hiding/showing the Dock";
"AUTOHIDETIMEMODIFIER_NO" = "Turning off animation when hiding/showing the Dock";
"HIDE_DOCK" = "Hiding the Dock";
"SHOW_DOCK" = "Showing the Dock";
"SIZEIMMUTABLE_YES" = "Locking the icons size in the Dock";
"SIZEIMMUTABLE_NO" = "Unlocking the icons size in the Dock";
"CONTENTSIMMUTABLE_YES" = "Locking the icons in the Dock";
"CONTENTSIMMUTABLE_NO" = "Unlocking the icons in the Dock";
"SINGLEAPP_YES" = "Turning on single application mode";
"SINGLEAPP_NO" = "Turning off single application mode";
"MOUSEOVERHILITESTACK_YES" = "Turning on the highlighted hover effect for the grid-view of a stack";
"MOUSEOVERHILITESTACK_NO" = "Turning off the highlighted hover effect for the grid-view of a stack";
"RECENTSPERSISTENTAPPS" = "Adding a Recent/Favorite Stack to the left side of the Dock";
"RECENTSPERSISTENTOTHERS" = "Adding a Recent/Favorite Stack to the right side of the Dock";
"SPACERPERSISTENTAPPS" = "Adding an invisible spacer to the left side of the Dock";
"SPACERPERSISTENTOTHERS" = "Adding an invisible spacer to the right side of the Dock";
"RESTORE_DOCK" = "Restoring the Dock's display and parameters";
"REINIT_DOCK" = "Reinitializing the Dock's hidden parameters";
"PARAMS_DOCK" = "Dock's hidden parameters";

/* PARAMETERS > SAFARI */
"LSQUARANTINE_YES" = "Showing alert message upon opening applications downloaded from the Internet";
"LSQUARANTINE_NO" = "Hiding alert message upon opening applications downloaded from the Internet";
"COMAPPLESAFARICONTENTPAGEGROUPIDENTIFIERWEBKIT2BACKSPACEKEYNAVIGATIONENABLED_YES" = "Using the Delete key to go to the previous web page";
"COMAPPLESAFARICONTENTPAGEGROUPIDENTIFIERWEBKIT2BACKSPACEKEYNAVIGATIONENABLED_NO" = "Using the standard keyboard shortcut to go to the previous web page";
"INCLUDEINTERNALDEBUGMENU_YES" = "Turning on Safari's Debug menu";
"INCLUDEINTERNALDEBUGMENU_NO" = "Turning off Safari's Debug menu";
"INCLUDEDEVELOPMENU_YES" = "Turning on Safari's Develop menu";
"INCLUDEDEVELOPMENU_NO" = "Turning off Safari's Develop menu";
"HISTORYLIMIT" = "Setting Safari's history parameters";
"REINIT_SAFARI" = "Reinitializing Safari's hidden parameters";
"PARAMS_SAFARI" = "Safari's hidden parameters";

/* PARAMETERS > ITUNES */
"CREATEFILENAMESWITHTRACKNUMBER_YES" = "Showing track numbers while importing in iTunes";
"CREATEFILENAMESWITHTRACKNUMBER_NO" = "Hiding track numbers while importing in iTunes";
"PLAYSONGSWHILEIMPORTING_YES" = "Turning on play while importing in iTunes";
"PLAYSONGSWHILEIMPORTING_NO" = "Turning off play while importing in iTunes";
"ALLOWHALFSTARS_YES" = "Turning on rating by a half-star";
"ALLOWHALFSTARS_NO" = "Turning off rating by a half-star";
"HIGHCONTRASTMODEENABLE_YES" = "Turning on the High Contrast mode in iTunes";
"HIGHCONTRASTMODEENABLE_NO" = "Turning off the High Contrast mode in iTunes";
"REINIT_ITUNES" = "Reinitializing iTunes' hidden parameters";
"PARAMS_ITUNES" = "iTunes' hidden parameters";

/* PARAMETERS > LOGIN */
"OPEN_IMAGELOGIN" = "Changing the background image of the login window";
"RESTORE_IMAGELOGIN" = "Restoring the background of the login window";
"LOGINWINDOWTEXT_YES" = "Showing a message in the login window";
"LOGINWINDOWTEXT_NO" = "Hiding the message in the login window";
"LOGINWINDOWTEXT" = "Modifying the login window's message";
"POWEROFFDISABLED_YES" = "Hiding the buttons in the login window";
"POWEROFFDISABLED_NO" = "Showing the buttons in the login window";
"HIDEADMINUSERS_YES" = "Hiding the Administrator users in the list of users";
"HIDEADMINUSERS_NO" = "Showing the Administrator users in the list of users";
"HIDELOCALUSERS_YES" = "Hiding the Standard users in the list of users";
"HIDELOCALUSERS_NO" = "Showing the Standard users in the list of users";
"INCLUDENETWORKUSER_YES" = "Showing the Network users in the list of users";
"INCLUDENETWORKUSER_NO" = "Hiding the Network users in the list of users";
"BOOTARGS" = "Setting the Startup mode";
"ALRT_BOOT" = "You have chosen the startup mode: Single-user.";
"MSG_BOOT" = "When the computer restarts, it won't load the Finder and won't display the desktop. \nTo return to normal Startup mode, enter the command: nvram boot-args='' ''";
"SYSTEMAUDIOVOLUME_ON" = "Turning on the startup sound";
"SYSTEMAUDIOVOLUME_OFF" = "Turning off the startup sound";
"POWERBUTTONSLEEPSSYSTEM_YES" = "Turning on the Sleep mode when the power button is pressed";
"POWERBUTTONSLEEPSSYSTEM_NO" = "Showing the Shutdown dialog when the power button is pressed";
"REINIT_LOGIN" = "Reinitializing the login window's parameters";
"PARAMS_LOGIN" = "Login window's parameters";

/* PARAMETERS > APPLICATIONS */
"SKIPVERIFY_YES" = "Turning on the verification of disk images";
"SKIPVERIFY_NO" = "Turning off the verification of disk images";
"DRBURNOPTIONSVERIFYBURN_YES" = "Turning on disc-verification after burning";
"DRBURNOPTIONSVERIFYBURN_NO" = "Turning off disc-verification after burning";
"SHOWBONJOURBROWSERDEBUG_YES" = "Showing the Bonjour browser in Screen Sharing";
"SHOWBONJOURBROWSERDEBUG_NO" = "Hiding the Bonjour browser in Screen Sharing";
"NSTOOLBARCONFIGURATIONCONTROLTOOLBAR_YES" = "Showing the full toolbar in Screen Sharing";
"NSTOOLBARCONFIGURATIONCONTROLTOOLBAR_NO" = "Hiding the full toolbar in Screen Sharing";
"MGPLAYMOVIEONOPEN_YES" = "Turning on auto-playing on movie opening";
"MGPLAYMOVIEONOPEN_NO" = "Turning off auto-playing on movie opening";
"QTPMOVIEINSPECTORSHOWPANEL_YES" = "Showing the QuickTime Player 7 Movie Inspector when it opens";
"QTPMOVIEINSPECTORSHOWPANEL_NO" = "Hiding the QuickTime Player 7 Movie Inspector when it opens";
"SHOWDEBUGMENU_YES" = "Showing the App Store Debug menu";
"SHOWDEBUGMENU_NO" = "Hiding the App Store Debug menu";
"AUTOMATICCHECKENABLEDCRITICALUPDATEINSTALL_YES" = "Turning on the automatic install of new malware definitions";
"AUTOMATICCHECKENABLEDCRITICALUPDATEINSTALL_NO" = "Turning off the automatic install of new malware definitions";
"MCXEXPOSEDISABLED_YES" = "Turning off Mission Control";
"MCXEXPOSEDISABLED_NO" = "Turning on Mission Control";
"EXPOSEANIMATIONDURATION_NO" = "Turning off the Mission Control graphic effect";
"EXPOSEANIMATIONDURATION_YES" = "Turning on the Mission Control graphic effect";
"NOQUITALERT_YES" = "Hiding the alert message before quitting X11";
"NOQUITALERT_NO" = "Showing the alert message before quitting X11";
"APPTORUN" = "Modifying the application to execute when X11 is opened";
"RESETLAUNCHPAD" = "Resetting Launchpad";
"REMINDERSDEBUGMENU_YES" = "Showing the Reminders Debug menu";
"REMINDERSDEBUGMENU_NO" = "Hiding the Reminders Debug menu";
"FOCUSFOLLOWSMOUSE_YES" = "Turning on the Terminal window focus";
"FOCUSFOLLOWSMOUSE_NO" = "Turning off the Terminal window focus";
"QUARTZDEBUG_YES" = "Showing Quartz Debug's hidden options";
"QUARTZDEBUG_NO" = "Hiding Quartz Debug's hidden options";
"MCXDISABLED_YES" = "Turning off Dashboard";
"MCXDISABLED_NO" = "Turning on Dashboard";
"REINIT_APPS" = "Reinitializing the application' hidden parameters";
"PARAMS_APPS" = "Application' hidden parameters";

/* PARAMETERS > MISC */
"INDEXSPOTLIGHT_YES" = "Turning on indexing of the startup disk";
"INDEXSPOTLIGHT_NO" = "Turning off indexing of the startup disk";
"DELETE_SPOTLIGHTINDEX" = "Deleting the Spotlight index of the startup disk";
"ENABLELOCAL" = "Turning on the Time Machine local backups";
"DISABLELOCAL" = "Turning off the Time Machine local backups";
"RESOLUTIONDISPLAYS" = "Displays (with resolutions)";
"EXTRASMENU" = "Showing the ";
"EXTRASMENUBAR" = " menu bar item in the menu bar";
"DIALOGTYPE_BASIC" = "Turning on the Basic mode for Diagnostic Reports";
"DIALOGTYPE_DEVELOPER" = "Turning on the Developer mode for Diagnostic Reports";
"DIALOGTYPE_SERVER" = "Turning on the Server mode for Diagnostic Reports";
"PP_ARCHIVES" = "Installing the Archives preferences pane";
"PP_NLC" = "Installing the Network Link Conditioner preferences pane";
"NOTIFICATIONCENTER_YES" = "Turning on Notification Center";
"NOTIFICATIONCENTER_NO" = "Turning off Notification Center";
"BANNERTIME" = "Modifying the notification’s display delay";
"DEVMODE_YES" = "Setting Help Viewer window to floating mode";
"DEVMODE_NO" = "Setting Help Viewer window to non-floating mode";
"NSAPPSLEEPDISABLED_YES" = "Turning off App Nap";
"NSAPPSLEEPDISABLED_NO" = "Turning on App Nap";
"BROWSEALLINTERFACES_YES" = "Turning on AirDrop";
"BROWSEALLINTERFACES_NO" = "Turning off AirDrop";
"NSDOCUMENTSAVENEWDOCUMENTSTOCLOUD_YES" = "Turning on the new document saving in iCloud Drive";
"NSDOCUMENTSAVENEWDOCUMENTSTOCLOUD_NO" = "Turning off the new document saving in iCloud Drive";
"REINIT_MISC" = "Reinitializing miscellaneous parameters";
"PARAMS_MISC" = "Miscellaneous parameters";

/* INFO */
"INFO_HARDWARE" = "Hardware";
"INFO_MEMORY" = "Memory";
"INFO_DISK" = "Disk";
"INFO_SOFTWARE" = "Software";
"INFO_MISC" = "Misc";
"NO_SN" = "The serial number was not initialized. \nThe motherboard was probably changed.";
"PURGE_MEMORY" = "Purging the inactive memory";
"DISABLE_SWAP" = "Turning off the virtual memory";
"ENABLE_SWAP" = "Turning on the virtual memory";
"JOURNAL_YES" = "Turning on Mac OS Extended format journaling";
"JOURNAL_NO" = "Turning off Mac OS Extended format journaling";
"SHOW_MINIPROFILE" = "Showing the mini profile";
"SHOW_BASICPROFILE" = "Showing the basic profile";
"SHOW_FULLPROFILE" = "Showing the full profile";
"SAVE_MINIPROFILE" = "Saving the mini profile";
"SAVE_BASICPROFILE" = "Saving the basic profile";
"SAVE_FULLPROFILE" = "Saving the full profile";
"PROFILE_SAVED" = "The profile has been saved.";
"MSG_XMLSAVED" = "The profile of your hardware and software configuration has been saved in XML format (.spx) on the desktop.";
"MSG_TXTSAVED" = "The profile of your hardware and software configuration has been saved in Text format (.txt) on the desktop.";
"ENTRIES" = "recognized malware";
"DELETELSQUARANTINEEVENT" = "Deleting the downloaded items list";
"SHOWLSQUARANTINEEVENT" = "Loading the downloaded items list";
"SYSDIAGNOSE" = "Executing and saving a full diagnostic";

/* ERRORS */
"ERROR" = "Error: ";
"ERR_AUTHENTICATE" = "The name or password you entered is incorrect.";
"MSG_AUTHENTICATE" = "Try entering your information again.";
"ERR_UPDATE" = "An error has occurred while looking for an OnyX update.";
"MSG_UPDATE" = "An error has been detected while searching for an update of OnyX. The website is momentarily unavailable, or you are not connected to the Internet.\n";
"ERR_DOWNLOADUPDATE" = "An error has occurred while downloading an OnyX update.";
"MSG_DOWNLOADUPDATE" = "Verify that the path you have set to download updates is correct (OnyX > Preferences > Update > Path).";
"ERR_SELECTION" = "No option was selected.";
"MSG_SELECTION" = "Select at least one option, then try again.";
"ERR_LOG" = "The OnyX log has been turned off.";
"MSG_LOG" = "You probably customized the Date & Time format in the System Preferences. A system issue prevents the operation of the OnyX log.";
"ERR_NOLOG" = "The log does not exist.";
"MSG_NOLOG" = "The OnyX log (~/Library/Logs/OnyX.log) doesn't exist. It has probably been removed.";
"MSG_NOSCRIPTLOG" = "This maintenance scripts log doesn't exist. It has probably been removed, or the maintenance scripts were never executed.";
"ERR_NOCOMMAND" = "No command was selected.";
"MSG_NOCOMMAND" = "Select a command in the list, or enter a command in the search field.";
"ERR_NOMANPAGE" = "There is no manual entry for this command.";
"MSG_NOMANPAGE1" = "The ";
"MSG_NOMANPAGE2" = " command is an unknown command or a manual entry.";
"ERR_DATAENTRY" = "A data entry error has occurred.";
"ERR_NODISK" = "No disk was selected.";
"MSG_NODISK" = "No disk was specified. Select a disk to modify.";
"MSG_NONAME" = "No name was specified. Enter a name.";
"MSG_POINTNAME" = "The specified name starts with a period. Files whose name starts with a period are hidden by the system. Enter another name.";
"ERR_SIP" = "Operation not permitted.";
"MSG_SIP" = "Impossible to run this operation. System Integrity Protection is probably turned on.";
"ERR_PREFPANE" = "An error has occurred while loading the preference pane.";
"MSG_PREFPANE" = "An error has been detected while installing the preference pane.";
"ERR_LOGINWINDOWTEXT" = "The Login Message was not registered.";
"MSG_LOGINWINDOWTEXT" = "You have probably used prohibited special characters. Modify your message and try again.";
"ERR_TYPEPROFILE" = "This profile is undefined.";
"MSG_TYPEPROFILE" = "Choose a style of profile.";
"ERR_FORMATPROFILE" = "The format is undefined.";
"MSG_FORMATPROFILE" = "Choose a format of profile.";
"MSG_SAVEPROFILE" = "An error has been detected while saving the profile of your configuration.";
"ERR_VALUE" = "Incorrect value.";
"MSG_VALUE" = "Enter a digit or a number.";

/* ALERTS */
"ALRT" = "Warning:";
"ALRT_ERASEFILE" = "Erase a file.";
"MSG_ERASEFILE" = "Do you really want to erase the file:\n";
"ALRT_ERASEFOLDER" = "Erase a folder.";
"MSG_ERASEFOLDER" = "Do you really want to erase the folder:\n";
"MSG_EMPTYTRASH" = "Do you really want to delete the Trash contents?";
"ALRT_FULLDISK" = "Startup disk almost full.";
"MSG_FULLDISK" = "You need to make more space available on the disk by deleting files.";
"ALRT_RESTARTNOW" = "This function will only take effect after restarting.\nDo you really want to force the computer to restart now? Remember to save your work.\n";
"ALRT_APPS" = "OnyX will force any open applications to quit. Check that no operation is in progress and that your documents are saved, then click Continue.\n";
"ALRT_ALLAPPS" = "OnyX will quit all open applications.";
"ALRT_FINDER" = "OnyX will reopen the Finder. Check that no operation is in progress (copying or moving files, emptying the Trash, and so on), then click Continue.\n";
"ALRT_FINDERDOCK" = "OnyX will reopen the Finder and the Dock. Check that no operation is in progress, then click Continue.";
"ALRT_DOCK" = "OnyX must reopen the Dock for this change to take effect.";
"ALRT_RESTOREDOCK" = "OnyX will restore the Dock and restart the computer. The parameters will be reset, and the display will be the same as when the system and the applications were first installed. Check that no operation is in progress and that your documents are saved, then click Continue.\n";
"ALRT_REINITDOCK" = "OnyX will reset the Dock's parameters and reopen it.";
"ALRT_QUICKTIME" = "OnyX will force QuickTime Player to quit. Verify that no operation is in progress, then click Continue.";
"ALRT_SAFARI" = "OnyX will force Safari to quit. Verify that no download is in progress, then click Continue.";
"ALRT_ITUNES" = "OnyX will force iTunes to quit. Verify that no operation is in progress, then click Continue.";
"ALRT_SYSTEMUISERVER" = "OnyX will relaunch the SystemUIServer process. This process displays the icons at the right of the Finder menu bar.\n";
"ALRT_DISKUTILITY" = "OnyX will force Disk Utility to quit. Verify that no operation is in progress, then click Continue.";
"ALRT_HELPVIEWER" = "OnyX will force Help Viewer to quit. Verify that no operation is in progress, then click Continue.";
"ALRT_SCREENSHARING" = "OnyX will force Screen Sharing to quit. Verify that no operation is in progress, then click Continue.";
"ALRT_X11" = "OnyX will force X11 and its applications to quit. Verify that no operation is in progress, then click Continue.";
"ALRT_APPSTORE" = "OnyX will force App Store to quit. Verify that no operation is in progress, then click Continue.";
"ALRT_REMINDERS" = "OnyX will force Reminders to quit. Verify that no operation is in progress, then click Continue.";
"ALRT_TERMINAL" = "OnyX will force Terminal to quit. Verify that no operation is in progress, then click Continue.";
"ALRT_QUARTZDEBUG" = "OnyX will force Quartz Debug to quit. Verify that no operation is in progress, then click Continue.";

"BAD_SYSTEM" = "OnyX will not work with this version of OS X.";
"GOOD_SYSTEM" = "This version of OnyX requires OS X version 10.11 (El Capitan).";
"ALRT_UNINSTALL" = "Uninstall OnyX.";
"MSG_UNINSTALL" = "Do you really want to uninstall OnyX and the components created while installing and using the application?\n";
"ALRT_RESTART" = "The selected commands have been successfully executed.";
"MSG_RESTART" = "Restart your computer now.";
"ALRT_QUIT" = "Quit OnyX.";
"MSG_QUIT" = "Do you really want to quit OnyX?";

"HACIA" = "by Laurent Hacia";
"IDIART" = "by Dominique Idiart";
"ZADORI" = "by Zádori Levente";
"HANSEN" = "by Alexander Nikolai Hansen";
"JACK" = "by Jack";
"NATHAN" = "by Nathan B.";
"JOEL" = "by Joël Barrière";
